reports/issue_134_raw_artifacts/raw_results/sharegpt-online/16/rep-1/bench.log
/root/vllm/vllm-hust/vllm/__init__.py:7: RuntimeWarning: Failed to read commit hash:
cannot import name '_version' from partially initialized module 'vllm' (most likely due to a circular import) (/root/vllm/vllm-hust/vllm/__init__.py)
  from .version import (  # isort:skip
INFO 08-05 08:59:06 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-05 08:59:06 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 08-05 08:59:06 [__init__.py:58] Loading plugin ascend
INFO 08-05 08:59:06 [__init__.py:246] Platform plugin ascend is activated
INFO 08-05 08:59:06 [platform.py:60] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
WARNING 08-05 08:59:40 [importing.py:78] Triton is installed, but `triton.backends` could not be imported. Disabling Triton.
INFO 08-05 08:59:40 [importing.py:93] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffcc6527ec0>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='sharegpt', no_stream=False, dataset_path='/data/shared_datasets/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8421, endpoint='/v1/completions', header=None, max_concurrency=None, model='/data/shared_models/Qwen--Qwen2.5-14B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/data/issue134-results/npu1.tmp/raw_results/sharegpt-online/16/rep-1', result_filename='raw.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-545aaf9d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None

  0%|          | 0/200 [00:00<?, ?it/s]
  0%|          | 1/200 [00:11<38:17, 11.54s/it]
  1%|          | 2/200 [00:23<39:17, 11.91s/it]
  2%|▏         | 3/200 [00:24<21:51,  6.66s/it]
  2%|▏         | 4/200 [00:41<35:12, 10.78s/it]
  2%|▎         | 5/200 [00:46<28:40,  8.82s/it]
  3%|▎         | 6/200 [00:47<20:13,  6.26s/it]
  4%|▎         | 7/200 [00:49<14:57,  4.65s/it]
  4%|▍         | 8/200 [00:49<10:46,  3.37s/it]
  4%|▍         | 9/200 [00:53<11:14,  3.53s/it]
  5%|▌         | 10/200 [00:54<08:46,  2.77s/it]
  6%|▌         | 11/200 [01:01<12:13,  3.88s/it]
  6%|▌         | 12/200 [01:01<08:47,  2.81s/it]
  6%|▋         | 13/200 [01:04<09:00,  2.89s/it]
  7%|▋         | 14/200 [01:05<07:27,  2.41s/it]
  8%|▊         | 16/200 [01:06<04:12,  1.37s/it]
  8%|▊         | 17/200 [01:06<03:37,  1.19s/it]
  9%|▉         | 18/200 [01:09<04:30,  1.49s/it]
 10%|▉         | 19/200 [01:10<04:10,  1.38s/it]
 10%|█         | 20/200 [01:12<05:06,  1.71s/it]
 11%|█         | 22/200 [01:15<04:52,  1.64s/it]
 12%|█▏        | 24/200 [01:19<05:03,  1.73s/it]
 13%|█▎        | 26/200 [01:20<03:36,  1.24s/it]
 14%|█▎        | 27/200 [01:22<04:01,  1.40s/it]
 14%|█▍        | 28/200 [01:22<03:17,  1.15s/it]
 14%|█▍        | 29/200 [01:23<03:00,  1.05s/it]
 15%|█▌        | 30/200 [01:23<02:28,  1.15it/s]
 16%|█▌        | 31/200 [01:27<04:32,  1.61s/it]
 16%|█▌        | 32/200 [01:31<06:18,  2.26s/it]
 16%|█▋        | 33/200 [01:32<05:44,  2.07s/it]
 17%|█▋        | 34/200 [01:36<06:33,  2.37s/it]
 18%|█▊        | 35/200 [01:38<06:50,  2.49s/it]
 18%|█▊        | 37/200 [01:41<05:12,  1.92s/it]
 19%|█▉        | 38/200 [01:41<04:18,  1.60s/it]
 20%|█▉        | 39/200 [01:42<03:25,  1.28s/it]
 20%|██        | 40/200 [01:44<04:03,  1.52s/it]
 20%|██        | 41/200 [01:46<04:16,  1.61s/it]
 21%|██        | 42/200 [01:47<04:02,  1.53s/it]
 22%|██▏       | 44/200 [01:53<05:42,  2.20s/it]
 22%|██▎       | 45/200 [01:55<05:12,  2.01s/it]
 23%|██▎       | 46/200 [01:56<04:59,  1.95s/it]
 24%|██▎       | 47/200 [02:00<05:56,  2.33s/it]
 24%|██▍       | 48/200 [02:01<05:14,  2.07s/it]
 24%|██▍       | 49/200 [02:02<04:11,  1.67s/it]
 25%|██▌       | 50/200 [02:02<03:23,  1.36s/it]
 26%|██▌       | 51/200 [02:06<05:15,  2.12s/it]
 26%|██▌       | 52/200 [02:07<03:56,  1.60s/it]
 26%|██▋       | 53/200 [02:08<03:29,  1.43s/it]
 27%|██▋       | 54/200 [02:08<02:42,  1.11s/it]
 28%|██▊       | 55/200 [02:10<02:56,  1.22s/it]
 28%|██▊       | 56/200 [02:17<07:39,  3.19s/it]
 28%|██▊       | 57/200 [02:18<05:52,  2.46s/it]
 29%|██▉       | 58/200 [02:25<08:51,  3.74s/it]
 30%|██▉       | 59/200 [02:28<08:17,  3.53s/it]
 30%|███       | 60/200 [02:29<06:13,  2.67s/it]
 31%|███       | 62/200 [02:31<04:29,  1.96s/it]
 32%|███▏      | 63/200 [02:33<04:46,  2.09s/it]
 32%|███▏      | 64/200 [02:35<04:13,  1.86s/it]
 32%|███▎      | 65/200 [02:35<03:14,  1.44s/it]
 33%|███▎      | 66/200 [02:35<02:43,  1.22s/it]
 34%|███▍      | 68/200 [02:36<01:48,  1.22it/s]
 34%|███▍      | 69/200 [02:38<02:15,  1.03s/it]
 35%|███▌      | 70/200 [02:39<02:11,  1.01s/it]
 36%|███▌      | 71/200 [02:41<02:38,  1.23s/it]
 36%|███▌      | 72/200 [02:45<04:19,  2.03s/it]
 36%|███▋      | 73/200 [02:46<04:04,  1.92s/it]
 38%|███▊      | 77/200 [02:50<02:45,  1.34s/it]
 40%|███▉      | 79/200 [02:53<02:35,  1.28s/it]
 40%|████      | 80/200 [02:54<02:33,  1.28s/it]
 40%|████      | 81/200 [02:55<02:34,  1.30s/it]
 42%|████▏     | 83/200 [02:57<02:11,  1.12s/it]
 42%|████▏     | 84/200 [02:59<02:22,  1.23s/it]
 43%|████▎     | 86/200 [03:03<03:08,  1.66s/it]
 44%|████▎     | 87/200 [03:04<02:36,  1.38s/it]
 44%|████▍     | 88/200 [03:06<02:47,  1.49s/it]
 45%|████▌     | 90/200 [03:06<01:46,  1.03it/s]
 46%|████▌     | 91/200 [03:12<03:57,  2.18s/it]
 46%|████▌     | 92/200 [03:13<03:19,  1.84s/it]
 46%|████▋     | 93/200 [03:14<02:46,  1.55s/it]
 47%|████▋     | 94/200 [03:14<02:20,  1.32s/it]
 48%|████▊     | 96/200 [03:17<02:09,  1.24s/it]
 48%|████▊     | 97/200 [03:17<01:54,  1.11s/it]
 49%|████▉     | 98/200 [03:20<02:20,  1.38s/it]
 50%|████▉     | 99/200 [03:20<01:57,  1.17s/it]
 50%|█████     | 100/200 [03:21<01:34,  1.06it/s]
 51%|█████     | 102/200 [03:23<01:46,  1.09s/it]
 52%|█████▏    | 104/200 [03:26<02:01,  1.26s/it]
 53%|█████▎    | 106/200 [03:27<01:36,  1.03s/it]
 54%|█████▎    | 107/200 [03:28<01:27,  1.06it/s]
 54%|█████▍    | 108/200 [03:29<01:31,  1.00it/s]
 55%|█████▍    | 109/200 [03:32<02:15,  1.49s/it]
 55%|█████▌    | 110/200 [03:33<02:07,  1.41s/it]
 56%|█████▌    | 111/200 [03:37<02:46,  1.87s/it]
 56%|█████▌    | 112/200 [03:39<02:53,  1.98s/it]
 56%|█████▋    | 113/200 [03:40<02:34,  1.77s/it]
 57%|█████▋    | 114/200 [03:43<02:52,  2.01s/it]
 58%|█████▊    | 116/200 [03:45<02:22,  1.70s/it]
 59%|█████▉    | 118/200 [03:49<02:17,  1.68s/it]
 60%|█████▉    | 119/200 [03:50<02:09,  1.59s/it]
 60%|██████    | 120/200 [04:04<06:03,  4.54s/it]
 60%|██████    | 121/200 [04:05<04:53,  3.71s/it]
 61%|██████    | 122/200 [04:10<05:09,  3.97s/it]
 62%|██████▏   | 123/200 [04:11<04:07,  3.22s/it]
 62%|██████▏   | 124/200 [04:13<03:36,  2.85s/it]
 62%|██████▎   | 125/200 [04:14<02:46,  2.22s/it]
 63%|██████▎   | 126/200 [04:15<02:23,  1.94s/it]
 64%|██████▎   | 127/200 [04:16<02:05,  1.72s/it]
 64%|██████▍   | 128/200 [04:19<02:20,  1.95s/it]
 64%|██████▍   | 129/200 [04:21<02:38,  2.24s/it]
 66%|██████▌   | 131/200 [04:23<01:41,  1.47s/it]
 66%|██████▋   | 133/200 [04:24<01:23,  1.25s/it]
 68%|██████▊   | 135/200 [04:34<02:41,  2.49s/it]
 68%|██████▊   | 136/200 [04:36<02:31,  2.37s/it]
 68%|██████▊   | 137/200 [04:39<02:46,  2.65s/it]
 69%|██████▉   | 138/200 [04:46<03:47,  3.67s/it]
 70%|██████▉   | 139/200 [04:50<03:44,  3.68s/it]
 70%|███████   | 140/200 [04:51<03:01,  3.02s/it]
 70%|███████   | 141/200 [04:54<02:49,  2.87s/it]
 71%|███████   | 142/200 [04:54<02:09,  2.24s/it]
 72%|███████▏  | 143/200 [05:02<03:42,  3.90s/it]
 72%|███████▏  | 144/200 [05:06<03:43,  3.99s/it]
 72%|███████▎  | 145/200 [05:08<02:55,  3.18s/it]
 73%|███████▎  | 146/200 [05:12<03:08,  3.49s/it]
 74%|███████▎  | 147/200 [05:19<04:04,  4.61s/it]
 74%|███████▍  | 148/200 [05:27<04:57,  5.73s/it]
 74%|███████▍  | 149/200 [05:29<03:52,  4.55s/it]
 75%|███████▌  | 150/200 [05:30<02:48,  3.38s/it]
 76%|███████▌  | 151/200 [05:33<02:41,  3.30s/it]
 76%|███████▌  | 152/200 [05:36<02:35,  3.24s/it]
 76%|███████▋  | 153/200 [05:40<02:38,  3.38s/it]
 77%|███████▋  | 154/200 [05:41<02:05,  2.73s/it]
 78%|███████▊  | 156/200 [05:46<01:54,  2.61s/it]
 78%|███████▊  | 157/200 [05:55<02:59,  4.17s/it]
 79%|███████▉  | 158/200 [05:57<02:35,  3.70s/it]
 80%|███████▉  | 159/200 [05:58<01:57,  2.86s/it]
 80%|████████  | 160/200 [06:03<02:16,  3.40s/it]
 80%|████████  | 161/200 [06:07<02:28,  3.80s/it]
 81%|████████  | 162/200 [06:09<02:02,  3.24s/it]
 82%|████████▏ | 163/200 [06:18<02:59,  4.85s/it]
 82%|████████▏ | 164/200 [06:19<02:09,  3.60s/it]
 82%|████████▎ | 165/200 [06:25<02:34,  4.42s/it]
 83%|████████▎ | 166/200 [06:26<01:51,  3.28s/it]
 84%|████████▎ | 167/200 [06:29<01:45,  3.21s/it]
 84%|████████▍ | 168/200 [06:36<02:21,  4.41s/it]
 84%|████████▍ | 169/200 [06:37<01:41,  3.28s/it]
 85%|████████▌ | 170/200 [06:49<02:57,  5.91s/it]
 86%|████████▌ | 171/200 [06:50<02:10,  4.49s/it]
 86%|████████▌ | 172/200 [06:52<01:49,  3.90s/it]
 86%|████████▋ | 173/200 [06:57<01:55,  4.26s/it]
 87%|████████▋ | 174/200 [07:06<02:23,  5.54s/it]
 88%|████████▊ | 175/200 [07:08<01:50,  4.42s/it]
 88%|████████▊ | 176/200 [07:10<01:31,  3.80s/it]
 88%|████████▊ | 177/200 [07:17<01:50,  4.83s/it]
 89%|████████▉ | 178/200 [07:22<01:42,  4.66s/it]
 90%|████████▉ | 179/200 [07:32<02:14,  6.42s/it]
 90%|█████████ | 180/200 [07:34<01:40,  5.02s/it]
 90%|█████████ | 181/200 [07:39<01:37,  5.13s/it]
 92%|█████████▏| 183/200 [07:52<01:38,  5.80s/it]
 92%|█████████▏| 184/200 [07:54<01:15,  4.70s/it]
 92%|█████████▎| 185/200 [07:54<00:54,  3.65s/it]
 93%|█████████▎| 186/200 [07:55<00:39,  2.83s/it]
 94%|█████████▎| 187/200 [07:56<00:31,  2.40s/it]
 94%|█████████▍| 188/200 [07:59<00:31,  2.60s/it]
 94%|█████████▍| 189/200 [08:15<01:11,  6.47s/it]
 95%|█████████▌| 190/200 [08:22<01:04,  6.42s/it]
 96%|█████████▌| 191/200 [08:24<00:47,  5.28s/it]
 96%|█████████▌| 192/200 [08:25<00:32,  4.08s/it]
 96%|█████████▋| 193/200 [08:33<00:35,  5.11s/it]
 97%|█████████▋| 194/200 [08:47<00:47,  7.86s/it]
 98%|█████████▊| 195/200 [09:03<00:50, 10.08s/it]
 98%|█████████▊| 196/200 [09:38<01:10, 17.54s/it]
 98%|█████████▊| 197/200 [09:50<00:48, 16.03s/it]
 99%|█████████▉| 198/200 [09:58<00:27, 13.63s/it]
100%|█████████▉| 199/200 [10:05<00:11, 11.70s/it]
100%|██████████| 200/200 [10:26<00:00, 14.29s/it]
100%|██████████| 200/200 [10:26<00:00,  3.13s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200
Failed requests:                         0
Request rate configured (RPS):           1.00
Benchmark duration (s):                  626.22
Total input tokens:                      43560
Total generated tokens:                  44135
Request throughput (req/s):              0.32
Output token throughput (tok/s):         70.48
Peak output token throughput (tok/s):    294.00
Peak concurrent requests:                103.00
Total token throughput (tok/s):          140.04
---------------Time to First Token----------------
Mean TTFT (ms):                          1687.46
Median TTFT (ms):                        1420.89
P99 TTFT (ms):                           4503.49
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          601.37
Median TPOT (ms):                        601.92
P99 TPOT (ms):                           755.36
---------------Inter-token Latency----------------
Mean ITL (ms):                           603.47
Median ITL (ms):                         612.31
P99 ITL (ms):                            1832.13
==================================================